Craix/OKDO_E1_PWM_Project_Kol/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define ENCODER_GPIO_SW_GPIO_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define ENCODER_GPIO_SW_GPIO_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define ENCODER_GPIO_SW_GPIO_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define ENCODER_GPIO_SW_GPIO_PIN 15U                   /*!<@brief PORT pin number */
#define ENCODER_GPIO_SW_GPIO_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_23 (number 20), ENC
  @{ */

/* Symbols to be used with GPIO driver */
#define ENCODER_GPIO_CHB_GPIO_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define ENCODER_GPIO_CHB_GPIO_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */
#define ENCODER_GPIO_CHB_GPIO_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define ENCODER_GPIO_CHB_GPIO_PIN 23U                   /*!<@brief PORT pin number */
#define ENCODER_GPIO_CHB_GPIO_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_16 (number 14), ENC
  @{ */

/* Symbols to be used with GPIO driver */
#define ENCODER_GPIO_CHA_GPIO_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define ENCODER_GPIO_CHA_GPIO_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */
#define ENCODER_GPIO_CHA_GPIO_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define ENCODER_GPIO_CHA_GPIO_PIN 16U                   /*!<@brief PORT pin number */
#define ENCODER_GPIO_CHA_GPIO_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void ENCODER_GPIO(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_13_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Switch between GPIO mode and I2C mode.: I2C mode. */
#define PIO0_13_EGP_I2C_MODE 0x00u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO0_13_FUNC_ALT1 0x01u
/*!
 * @brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO0_14_DIGIMODE_DIGITAL 0x01u
/*!
 * @brief Switch between GPIO mode and I2C mode.: I2C mode. */
#define PIO0_14_EGP_I2C_MODE 0x00u
/*!
 * @brief Selects pin function.: Alternative connection 1. */
#define PIO0_14_FUNC_ALT1 0x01u

/*! @name PIO0_14 (number 72), FX1
  @{ */
#define OLED_I2C_SCL_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define OLED_I2C_SCL_PIN 14U                   /*!<@brief PORT pin number */
#define OLED_I2C_SCL_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*! @name PIO0_13 (number 71), FX1
  @{ */
#define OLED_I2C_SDA_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define OLED_I2C_SDA_PIN 13U                   /*!<@brief PORT pin number */
#define OLED_I2C_SDA_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void OLED_I2C(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define PIO1_4_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_4_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */
#define PIO1_7_DIGIMODE_DIGITAL 0x01u /*!<@brief Select Digital mode.: Enable Digital mode. Digital input is enabled. */
#define PIO1_7_FUNC_ALT3 0x03u        /*!<@brief Selects pin function.: Alternative connection 3. */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PWM_GPIO(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
